task-tracker-1c/src/Catalogs/тз_Комментарии/тз_Комментарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тз_Комментарии</name>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DocumentRef.тз_Задание</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.тз_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКомментария</name>
    <type>
      <types>EnumRef.тз_ТипыКомментариев</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрисоединенныеФайлы</name>
    <attributes>
      <name>ПрисоединенныйФайл</name>
      <type>
        <types>CatalogRef.тз_ЗаданиеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

task-tracker-1c/src/Catalogs/тз_Комментарии/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьДатуПоследнегоКомментарияПоЗаданию(Задание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	тз_Комментарии.Ссылка КАК Ссылка,
		|	тз_Комментарии.ДатаСоздания КАК ДатаСоздания
		|ИЗ
		|	Справочник.тз_Комментарии КАК тз_Комментарии
		|ГДЕ
		|	тз_Комментарии.Задание = &Задание
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ДатаСоздания;
	
КонецФункции
